In [2]:
import numpy as np
import pandas as pd

In [3]:
data= [1, 3, 5, 7, 9]
pd.DataFrame(data)

   0
0  1
1  3
2  5
3  7
4  9

In [5]:
pd.DataFrame(data, columns=["Col1"])

   Col1
0     1
1     3
2     5
3     7
4     9

In [6]:
pd.DataFrame(data, index = ["A","B","C","D","E"], columns=["Col1"])

   Col1
A     1
B     3
C     5
D     7
E     9

In [8]:
data = np.arange(1,24,2).reshape(3,4)
df = pd.DataFrame(data=data, columns=["var1","var2","var3","var4"])
df

   var1  var2  var3  var4
0     1     3     5     7
1     9    11    13    15
2    17    19    21    23

In [9]:
s1 = np.random.randint(2, 10, size = 4)
s2 = np.random.randint(3, 10, size = 4)
s3 = np.random.randint(4, 15, size = 4)
s1, s2, s3

(array([4, 5, 5, 5]), array([7, 3, 6, 4]), array([ 6, 13,  8, 14]))

In [10]:
mydict  = {"var1":s1, "var2":s2, "var3":s3}
mydict

{'var1': array([4, 5, 5, 5]),
 'var2': array([7, 3, 6, 4]),
 'var3': array([ 6, 13,  8, 14])}

In [11]:
df= pd.DataFrame(data=mydict)
df

   var1  var2  var3
0     4     7     6
1     5     3    13
2     5     6     8
3     5     4    14

In [14]:
df.head(2)

   var1  var2  var3
0     4     7     6
1     5     3    13

In [15]:
df.tail(2)

   var1  var2  var3
2     5     6     8
3     5     4    14

In [16]:
df.sample(3)

   var1  var2  var3
0     4     7     6
3     5     4    14
2     5     6     8

In [17]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [19]:
df.mean(axis=1)

0    5.666667
1    7.000000
2    6.333333
3    7.666667
dtype: float64

In [20]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [21]:
df.index[2]

2

In [22]:
df.values

array([[ 4,  7,  6],
       [ 5,  3, 13],
       [ 5,  6,  8],
       [ 5,  4, 14]])

In [24]:
df.columns = ["new1","new2","new3"]
df

   new1  new2  new3
0     4     7     6
1     5     3    13
2     5     6     8
3     5     4    14

In [26]:
df.index = ["a","b","c","d"]
df

   new1  new2  new3
a     4     7     6
b     5     3    13
c     5     6     8
d     5     4    14

In [31]:
df.rename(index={"a":1, "b": 2}, inplace=True)
df

   new1  new2  new3
1     4     7     6
2     5     3    13
c     5     6     8
d     5     4    14

In [32]:
df.shape

(4, 3)

In [33]:
df.shape[1]

3

In [34]:
len(df)

4

In [35]:
df.size

12

In [36]:
df.ndim

2

In [39]:
df.count(axis=1)

1    3
2    3
c    3
d    3
dtype: int64

In [40]:
type(df)

pandas.core.frame.DataFrame

In [43]:
type(df["new1"])

pandas.core.series.Series

In [45]:
df[["new1"]]

   new1
1     4
2     5
c     5
d     5

In [47]:
"new2" in df

True

In [48]:
from numpy.random import randn

In [49]:
np.random.seed(101)
df=pd.DataFrame(randn(5,4), index="A B C D E".split(), columns="W X Y Z".split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
df[["Y"]]

          Y
A  0.907969
B -0.848077
C  0.528813
D -0.933237
E  2.605967

In [53]:
df[["W","Z"]]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [58]:
df.drop(columns=df.columns[0:2])

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057
E  2.605967  0.683509

In [59]:
data = np.random.randint(1, 40, size=(8, 4))
df = pd.DataFrame(data, columns = ["var1", "var2", "var3", 'var4'])
df

   var1  var2  var3  var4
0     8    11    39    10
1    19     8    16     1
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11
5    21    28     9    23
6    27    24    38    23
7    10     3    19    29

In [60]:
df.loc[2:5]

   var1  var2  var3  var4
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11
5    21    28     9    23

In [61]:
df.loc["2":"5"]

   var1  var2  var3  var4
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11
5    21    28     9    23

In [62]:
df.iloc[2:5]

   var1  var2  var3  var4
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11

In [63]:
df

   var1  var2  var3  var4
0     8    11    39    10
1    19     8    16     1
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11
5    21    28     9    23
6    27    24    38    23
7    10     3    19    29

In [64]:
df.index = 'a b c d e f g h'.split()  # index değerlerini değiştirmek için. aatama yapılan değerlerin uzunluğu ile df'in uzunluğu aynı olmalı
df

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

In [65]:
df.iloc[1:4]

   var1  var2  var3  var4
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37

In [68]:
df.loc["b":"e"]

   var1  var2  var3  var4
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11

In [69]:
df

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

In [70]:
df.loc["d":"g","var2"]

d    30
e    36
f    28
g    24
Name: var2, dtype: int32

In [72]:
df.loc["d":"g"]["var2"]

d    30
e    36
f    28
g    24
Name: var2, dtype: int32

In [74]:
df.loc["d":"g"].var2

29.5

In [75]:
type(df.loc["d":"g"].var2)

pandas.core.series.Series

In [76]:
df.loc["d":"g"][["var2"]]

   var2
d    30
e    36
f    28
g    24

In [78]:
df.loc["d":"g",["var2"]]

var2    29.5
dtype: float64

In [82]:
df.loc["d":"g",["var2"]].loc["e"]

var2    36
Name: e, dtype: int32

In [80]:
df.loc["d":"g",["var1", "var3"]]

   var1  var3
d    34    25
e    20    31
f    21     9
g    27    38

In [81]:
df

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

In [85]:
df.loc[df["var2"] > 10]["var2"]

a    11
c    18
d    30
e    36
f    28
g    24
Name: var2, dtype: int32

In [84]:
df["var2"] > 10

a     True
b    False
c     True
d     True
e     True
f     True
g     True
h    False
Name: var2, dtype: bool

In [86]:
df.loc[df["var2"] > 10, ["var2"]]

   var2
a    11
c    18
d    30
e    36
f    28
g    24

In [87]:
df.loc[df["var2"] > 10, ["var2"]]

   var2
a    11
c    18
d    30
e    36
f    28
g    24

In [88]:
df.iloc[::-1,::-1]

   var4  var3  var2  var1
h    29    19     3    10
g    23    38    24    27
f    23     9    28    21
e    11    31    36    20
d    37    25    30    34
c    16    12    18    13
b     1    16     8    19
a    10    39    11     8

In [90]:
df.loc[(df["var2"] > 10) & (df["var3"]<30), ["var2", "var3"]]

   var2  var3
c    18    12
d    30    25
f    28     9